IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/msp/mspm0g1x0x_g3x0x/ADC1_4MSPS_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="ADC1" HW_revision="1.0">
    <register id="ADC1_FSUB_0" width="32" offset="0x400" description="Subscriber Configuration Register.">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <register id="ADC1_FPUB_1" width="32" offset="0x444" description="Publisher Configuration Register.">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="3" end="0" width="4" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 255."/>
        </bitfield>
    </register>
    <group id="ADC1_GPRCM" name="ADC1_GPRCM" instances="1" offset="0x800" instaddr="0x100" description="">
        <register id="ADC1_PWREN" width="32" offset="0x0" description="Power enable">
            <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
                <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
            </bitfield>
        </register>
        <register id="ADC1_RSTCTL" width="32" offset="0x4" description="Reset Control">
            <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
            </bitfield>
            <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
            </bitfield>
        </register>
        <register id="ADC1_CLKCFG" width="32" offset="0x8" description="ADC clock configuration Register">
            <bitfield id="SAMPCLK" description="ADC sample clock source selection." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="SYSOSC" value="0x0" description="SYSOSC is the source of ADC sample clock."/>
                <bitenum id="ULPCLK" value="0x1" description="ULPCLK is the source of ADC sample clock."/>
                <bitenum id="HFCLK" value="0x2" description="HFCLK clock is the source of ADC sample clock."/>
            </bitfield>
            <bitfield id="CCONRUN" description="CCONRUN: Forces SYSOSC to run at base frequency when device is in RUN mode which can be used as ADC sample or conversion clock source." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="ADC conversion clock source is not kept continuously on during RUN mode."/>
                <bitenum id="ENABLE" value="0x1" description="ADC conversion clock source kept continuously on during RUN mode."/>
            </bitfield>
            <bitfield id="CCONSTOP" description="CCONSTOP: Forces SYSOSC to run at base frequency when device is in STOP mode which can be used as ADC sample or conversion clock source." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="ADC conversion clock source is not kept continuously on during STOP mode."/>
                <bitenum id="ENABLE" value="0x1" description="ADC conversion clock source kept continuously on during STOP mode."/>
            </bitfield>
        </register>
        <register id="ADC1_STAT" width="32" offset="0x14" description="Status Register">
            <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
                <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
                <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
            </bitfield>
        </register>
    </group>
    <group id="ADC1_INT_EVENT0" name="ADC1_INT_EVENT0" instances="1" offset="0x1020" instaddr="0x30" description="">
        <register id="ADC1_INT_EVENT0_IIDX" width="32" offset="0x0" description="Interrupt index">
            <bitfield id="STAT" description="Interrupt index status" begin="9" end="0" width="10" rwaccess="R">
                <bitenum id="NO_INTR" value="0x0" description="No bit is set means there is no pending interrupt request"/>
                <bitenum id="OVIFG" value="0x1" description="MEMRESx overflow interrupt"/>
                <bitenum id="TOVIFG" value="0x2" description="Sequence Conversion time overflow interrupt"/>
                <bitenum id="HIGHIFG" value="0x3" description="High threshold compare interrupt"/>
                <bitenum id="LOWIFG" value="0x4" description="Low threshold compare interrupt"/>
                <bitenum id="INIFG" value="0x5" description="Primary Sequence In range comparator interrupt"/>
                <bitenum id="DMADONE" value="0x6" description="DMA done interrupt, generated on DMA transfer completion,"/>
                <bitenum id="UVIFG" value="0x7" description="MEMRESx underflow interrupt"/>
                <bitenum id="MEMRESIFG0" value="0x9" description="MEMRES0 data loaded interrupt"/>
                <bitenum id="MEMRESIFG1" value="0xA" description="MEMRES1 data loaded interrupt"/>
                <bitenum id="MEMRESIFG2" value="0xB" description="MEMRES2 data loaded interrupt"/>
                <bitenum id="MEMRESIFG3" value="0xC" description="MEMRES3 data loaded interrupt"/>
                <bitenum id="MEMRESIFG4" value="0xD" description="MEMRES4 data loaded interrupt"/>
                <bitenum id="MEMRESIFG5" value="0xE" description="MEMRES5 data loaded interrupt"/>
                <bitenum id="MEMRESIFG6" value="0xF" description="MEMRES6 data loaded interrupt"/>
                <bitenum id="MEMRESIFG7" value="0x10" description="MEMRES7 data loaded interrupt"/>
                <bitenum id="MEMRESIFG8" value="0x11" description="MEMRES8 data loaded interrupt"/>
                <bitenum id="MEMRESIFG9" value="0x12" description="MEMRES9 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG10" value="0x13" description="MEMRES10 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG11" value="0x14" description="MEMRES11 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG12" value="0x15" description="MEMRES12 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG13" value="0x16" description="MEMRES13 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG14" value="0x17" description="MEMRES14 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG15" value="0x18" description="MEMRES15 data  loaded interrupt"/>
                <bitenum id="MEMRESIFG16" value="0x19" description="MEMRES16 data loaded interrupt"/>
                <bitenum id="MEMRESIFG17" value="0x1A" description="MEMRES17 data loaded interrupt"/>
                <bitenum id="MEMRESIFG18" value="0x1B" description="MEMRES18 data loaded interrupt"/>
                <bitenum id="MEMRESIFG19" value="0x1C" description="MEMRES19 data loaded interrupt"/>
                <bitenum id="MEMRESIFG20" value="0x1D" description="MEMRES20 data loaded interrupt"/>
                <bitenum id="MEMRESIFG21" value="0x1E" description="MEMRES21 data loaded interrupt"/>
                <bitenum id="MEMRESIFG22" value="0x1F" description="MEMRES22 data loaded interrupt"/>
                <bitenum id="MEMRESIFG23" value="0x20" description="MEMRES23 data loaded interrupt"/>
            </bitfield>
        </register>
        <register id="ADC1_INT_EVENT0_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="INIFG" description="Mask INIFG in MIS_EX register." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="LOWIFG" description="Raw interrupt flag for the MEMRESx result register being below
than the WCLOWx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="HIGHIFG" description="Raw interrupt flag for the MEMRESx result register being higher
than the WCHIGHx threshold of the window comparator.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="OVIFG" description="Raw interrupt flag for MEMRESx overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="UVIFG" description="Raw interrupt flag for MEMRESx underflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR is set to 1." begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="TOVIFG" description="Raw interrupt flag for sequence conversion timeout overflow.
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="DMADONE" description="Raw interrupt flag for DMADONE. 
This bit is reset to 0 by IIDX read or when corresponding bit in
ICLR_EX is set to 1." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Interrupt is not pending."/>
                <bitenum id="SET" value="0x1" description="Interrupt is pending."/>
            </bitfield>
            <bitfield id="MEMRESIFG0" description="Raw interrupt status for MEMRES0.
This bit is set to 1 when MEMRES0 is loaded with a new
conversion result.
Reading MEMRES0 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG1" description="Raw interrupt status for MEMRES1.
This bit is set to 1 when MEMRES1 is loaded with a new
conversion result.
Reading MEMRES1 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG2" description="Raw interrupt status for MEMRES2.
This bit is set to 1 when MEMRES2 is loaded with a new
conversion result.
Reading MEMRES2 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG3" description="Raw interrupt status for MEMRES3.
This bit is set to 1 when MEMRES3 is loaded with a new
conversion result.
Reading MEMRES3 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG4" description="Raw interrupt status for MEMRES4.
This bit is set to 1 when MEMRES4 is loaded with a new
conversion result.
Reading MEMRES4 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG5" description="Raw interrupt status for MEMRES5.
This bit is set to 1 when MEMRES5 is loaded with a new
conversion result.
Reading MEMRES5 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG6" description="Raw interrupt status for MEMRES6.
This bit is set to 1 when MEMRES6 is loaded with a new
conversion result.
Reading MEMRES6 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG7" description="Raw interrupt status for MEMRES7.
This bit is set to 1 when MEMRES7 is loaded with a new
conversion result.
Reading MEMRES7 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG9" description="Raw interrupt status for MEMRES9.
This bit is set to 1 when MEMRES9 is loaded with a new
conversion result.
Reading MEMRES9 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="17" end="17" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG10" description="Raw interrupt status for MEMRES10.
This bit is set to 1 when MEMRES10 is loaded with a new
conversion result.
Reading MEMRES10 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="18" end="18" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG11" description="Raw interrupt status for MEMRES11.
This bit is set to 1 when MEMRES11 is loaded with a new
conversion result.
Reading MEMRES11 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="19" end="19" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
            <bitfield id="MEMRESIFG8" description="Raw interrupt status for MEMRES8.
This bit is set to 1 when MEMRES8 is loaded with a new
conversion result.
Reading MEMRES8 register will clear this bit, or when the
corresponding bit in ICLR is set to 1" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="No new data ready."/>
                <bitenum id="SET" value="0x1" description="A new data is ready to be read."/>
            </bitfield>
        </register>
